tap "homebrew/bundle"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNU compiler collection
brew "gcc"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Manage Procfile-based applications
brew "foreman"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Ruby version manager
brew "rbenv"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Compare files and folders
cask "beyond-compare"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
vscode "1000ch.svgo"
vscode "anteprimorac.html-end-tag-labels"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jmsv.javascriptsnippetsstandard"
vscode "johnpapa.vscode-peacock"
vscode "liviuschera.noctis"
vscode "mohammadbaqer.better-folding"
vscode "octref.vetur"
vscode "vscode-icons-team.vscode-icons"
vscode "zobo.php-intellisense"
